tutorials/laminar/hourglass/Allrun
#!/bin/sh

# create vol mesh
blockMesh

# create fa mesh
makeFaMesh

# create the intial time folder
cp -r 0_org 0

# Run sedExnerFoam
sedExnerFoam > log


